# In-Class Exercises:

In [ ]:
!pip install seaborn

In [19]:
import pandas as pd
import numpy as np
import seaborn as sns

## 6.1.

In [22]:
df = pd.DataFrame({
    'features': [1.0, 2.3, 5.5, 6.9],
    'labels': [0, 1, 2, 3]
})

df

   features  labels
0       1.0       0
1       2.3       1
2       5.5       2
3       6.9       3

## 6.2.

In [23]:
df = df.rename(columns = {'labels' : 'label'})
df

   features  label
0       1.0      0
1       2.3      1
2       5.5      2
3       6.9      3

## 6.3.

In [24]:
iris = sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [25]:
iris.sort_values(by='species', ascending=False)

     sepal_length  sepal_width  petal_length  petal_width    species
149           5.9          3.0           5.1          1.8  virginica
111           6.4          2.7           5.3          1.9  virginica
122           7.7          2.8           6.7          2.0  virginica
121           5.6          2.8           4.9          2.0  virginica
120           6.9          3.2           5.7          2.3  virginica
..            ...          ...           ...          ...        ...
31            5.4          3.4           1.5          0.4     setosa
30            4.8          3.1           1.6          0.2     setosa
29            4.7          3.2           1.6          0.2     setosa
28            5.2          3.4           1.4          0.2     setosa
0             5.1          3.5           1.4          0.2     setosa

[150 rows x 5 columns]

## 6.4.

In [27]:
iris.value_counts('species')

species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [29]:
# can convert it from series to a dataframe:
iris.value_counts('species').to_frame('Species Count') # can pass name of the column.

            Species Count
species
setosa                 50
versicolor             50
virginica              50

## 6.5.

In [31]:
len(iris[(iris.petal_length <= 1.4) | (iris.petal_length >= 1.6)])

137

## 6.6.

In [35]:
iris['min_petal'] = iris.apply(lambda x: min(x.petal_length, x.petal_width), axis = 1)
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species  min_petal
0           5.1          3.5           1.4          0.2  setosa        0.2
1           4.9          3.0           1.4          0.2  setosa        0.2
2           4.7          3.2           1.3          0.2  setosa        0.2
3           4.6          3.1           1.5          0.2  setosa        0.2
4           5.0          3.6           1.4          0.2  setosa        0.2

## 6.7.

In [42]:
pivot_table = pd.pivot_table(iris, values=['sepal_width', 'petal_width'],columns=['species'],aggfunc=[np.mean, np.median])
print(pivot_table)

              mean                      median
species     setosa versicolor virginica setosa versicolor virginica
petal_width  0.246      1.326     2.026    0.2        1.3       2.0
sepal_width  3.428      2.770     2.974    3.4        2.8       3.0

C:\Users\Chris\AppData\Local\Temp\ipykernel_18172\2012071744.py:1: FutureWarning: The provided callable <function mean at 0x000001F156BA3C40> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pivot_table = pd.pivot_table(iris, values=['sepal_width', 'petal_width'],columns=['species'],aggfunc=[np.mean, np.median])
C:\Users\Chris\AppData\Local\Temp\ipykernel_18172\2012071744.py:1: FutureWarning: The provided callable <function median at 0x000001F156CC7740> is currently using DataFrameGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  pivot_table = pd.pivot_table(iris, values=['sepal_width', 'petal_width'],columns=['species'],aggfunc=[np.mean, np.median])

## 6.8.

In [50]:
left = pd.DataFrame({'key': ['jamie', 'bill'], 'lval': [15, 22]})
left = left.set_index('key')

right = pd.DataFrame({'key': ['jam', 'billie', 'james'], 'rval': [23, 48, 82]})
right = right.set_index('key')

inner = pd.merge(left, right, on = 'key', how = 'inner')
inner

outer = left.join(right, how = 'outer')
outer

        lval  rval
key
bill    22.0   NaN
billie   NaN  48.0
jam      NaN  23.0
james    NaN  82.0
jamie   15.0   NaN

## 6.9.

In [51]:
ser = pd.Series([1,1,2,3,5,8])
vals = ser.values
resh = vals.reshape(2,3)

In [52]:
resh

array([[1, 1, 2],
       [3, 5, 8]])

In [53]:
resh.shape

(2, 3)

## 6.10.

In [54]:
cats = pd.DataFrame({
    'bread': ['persian', 'persian', 'siamese', 'himalyan', 'burmese'],
    'color': ['calico', 'white', 'seal point', 'cream', 'sable']
})

In [55]:
cats_combo = pd.get_dummies(cats, prefix = ['b', 'c'])
cats_combo

,b_burmese,b_himalyan,b_persian,b_siamese,c_calico,c_cream,c_sable,c_seal point,c_white
0,False,False,True,False,True,False,False,False,False
1,False,False,True,False,False,False,False,False,True
2,False,False,False,True,False,False,False,True,False
3,False,True,False,False,False,True,False,False,False
4,True,False,False,False,False,False,True,False,False